{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "#Написать программу, которая будет складывать, вычитать, умножать или делить два числа.\n",
    "#Числа и знак операции вводятся пользователем.\n",
    "#После выполнения вычисления программа не завершается, а запрашивает новые данные для вычислений.\n",
    "#Завершение программы должно выполняться при вводе символа '0' в качестве знака операции.\n",
    "#Если пользователь вводит неверный знак (не '0', '+', '-', '', '/'),\n",
    "#программа должна сообщать об ошибке и снова запрашивать знак операции.\n",
    "#Также она должна сообщать пользователю о невозможности деления на ноль, если он ввел его в качестве делителя.\n",
    "\n",
    "#создаем цикл\n",
    "while True:\n",
    "    #ввод значений с проверкой данных; если допущена ошибка - выдается сообщение об ошибке \"Введите правильные данные!\"\n",
    "    try:\n",
    "        #вводим два числа; если введено не число, будет предложено попробовать еще раз\n",
    "        a = float (input ('Введите первое число: '))\n",
    "        b = float (input ('Введите второе число: '))\n",
    "        #вводим знак математического действия\n",
    "        sign = str(input ('Введите знак математичекой операции (для деления, * для умножения, - для вычитания, + для сложения): '))\n",
    "        #проверка: если введен ноль в качестве знака мат. операции, то цикл завершается\n",
    "        if sign == '0':\n",
    "            print ('Программа завершена.')\n",
    "            break\n",
    "        #если этот знак равен одному из знаков математического действия из задачи, выполняем эти действия\n",
    "        #если введен знак деления\n",
    "        elif sign == '/':\n",
    "            #а второе число = нулю\n",
    "            if  b==0:\n",
    "                #сообщаем об ошибке\n",
    "                print('Деление на ноль невозможно. Решений нет.')\n",
    "            #а если условие b=0 не выполняется, то программа выполнит деление\n",
    "            else:\n",
    "                print(f'Результат математической операции {a}{sign}{b} = {a/b}.')\n",
    "        #если же введен знак умножения, числа умножаются\n",
    "        elif sign == '*':\n",
    "            print(f'Результат математической операции {a}{sign}{b} = {a*b}.')\n",
    "        #если введен знак вычитания - производится вычитание\n",
    "        elif sign == '-':\n",
    "            print(f'Результат математической операции {a}{sign}{b} = {a-b}.')\n",
    "        #и если знак сложения - выполняем сложение\n",
    "        elif sign == '+':\n",
    "            print(f'Результат математической операции {a}{sign}{b} = {a+b}.')\n",
    "        #и цикл начнется заново\n",
    "        # в других случаях, когда sign равен чему-то непредусмотренному, цикл просто запустится заново\n",
    "        else:\n",
    "            print(f'Вы допустили ошибку. \\nПопробуйте еще раз.')\n",
    "    #обработка ошибки ввода значений (цифры)\n",
    "    except ValueError:\n",
    "        print(\"Введите правильные данные!\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
